### Exercise 12: Merging, joining, aligning and concatenating Data

### Concatenating DataFrames vertically

__Import__ the cars dataset (with cars from usa and europe) from the csv-file __cars_clean.csv__. <br>
Also __import__ the csv-file __cars_jap.csv__ (with cars from japan) and __concatenate__ both DataFrames __vertically__! <br>
__Save__ the __concatenated DataFrame__ in the variable __cars_all__! <br>
Finally, __sort__ cars_all by the model_year from __low to high__!

### Left Join

In [105]:
import pandas as pd

In [106]:
clean = pd.read_csv('../data/part2/cars_clean.csv')
jap = pd.read_csv('../data/part2/cars_jap.csv')

In [107]:
split = jap.name.str.split(' ', n=1,expand=True)
split.columns = ['corp', 'name']
jap.drop('name', axis=1, inplace=True)
jap = pd.concat([jap, split], axis =1)

In [108]:
jap.head(), clean.head()

(    mpg  cyl   disp    hp  weight   acc  year    corp            name
 0  24.0    4  113.0  95.0    2372  15.0    70  toyota  corona mark ii
 1  27.0    4   97.0  88.0    2130  14.5    70  datsun           pl510
 2  27.0    4   97.0  88.0    2130  14.5    71  datsun           pl510
 3  25.0    4  113.0  95.0    2228  14.0    71  toyota          corona
 4  31.0    4   71.0  65.0    1773  19.0    71  toyota    corolla 1200,
     mpg  cyl  disp   hp  weight   acc  year origin       corp             name
 0  18.0    8   307  130    3504  12.0    70    usa  chevrolet  chevelle malibu
 1  15.0    8   350  165    3693  11.5    70    usa      buick      skylark 320
 2  18.0    8   318  150    3436  11.0    70    usa   plymouth        satellite
 3  16.0    8   304  150    3433  12.0    70    usa        amc        rebel sst
 4  17.0    8   302  140    3449  10.5    70    usa       ford           torino)

In [109]:
jap.insert(7, 'origin', 'japan')

In [110]:

cars_all = pd.concat([jap, clean], ignore_index=True)

In [111]:
cars_all.iloc[[20, 60]]

     mpg  cyl   disp    hp  weight   acc  year origin    corp  name
20  26.0    4  108.0  93.0    2391  15.5    74  japan  subaru  None
60  32.3    4   97.0  67.0    2065  17.8    81  japan  subaru  None

In [125]:
cars_all.sort_values('year', ignore_index=True, inplace=True)

In [126]:
cars_all

,mpg,cyl,disp,hp,weight,acc,year,origin,corp,name
0,24.0,4,113.0,95.0,2372,15.0,70,japan,toyota,corona mark ii
1,9.0,8,304.0,193.0,4732,18.5,70,usa,ih,1200d
2,11.0,8,318.0,210.0,4382,13.5,70,usa,dodge,d200
3,10.0,8,307.0,200.0,4376,15.0,70,usa,chevrolet,c20
4,10.0,8,360.0,215.0,4615,14.0,70,usa,ford,f250
...,...,...,...,...,...,...,...,...,...,...
393,34.0,4,108.0,70.0,2245,16.9,82,japan,toyota,corolla
394,38.0,4,91.0,67.0,1965,15.0,82,japan,honda,civic
395,32.0,4,91.0,67.0,1965,15.7,82,japan,honda,civic (auto)
396,27.0,4,151.0,90.0,2735,18.0,82,usa,pontiac,phoenix
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevrolet,s-10

__Import__ the csv-files __summer.csv__ (as summer) and __dictionary.csv__ (as dic) which contains the __full country name__ for the olympic country codes as well as __population__ and __gdp__ statistics for some countries.<br>

__"Copy and paste"__ the __full country name__, __population__ and __gdp__ from the dic DataFrame __into the summer DataFrame__ with a __Left Join__!<br>
__Save__ the new merged DataFrame in the variable __summer_new__!<br>

__Inspect__ summer_new and determine the __olympic country codes__ for which the dic DataFrame does __not provide__ any information!

In [128]:
summer = pd.read_csv('../data/part2/summer.csv')
dic = pd.read_csv('../data/part2/dictionary.csv')

In [137]:
dic.head()

           Country Code  Population  GDP per Capita
0      Afghanistan  AFG  32526562.0      594.323081
1          Albania  ALB   2889167.0     3945.217582
2          Algeria  ALG  39666519.0     4206.031232
3  American Samoa*  ASA     55538.0             NaN
4          Andorra  AND     70473.0             NaN

In [187]:
summer_new = summer.merge(dic, how='left', left_on='Country', right_on='Code')
#summer_new.drop('Country_x', axis=1, inplace=True)
#summer_new.rename({'Country_y':'Country'}, axis=1, inplace=True)

,Year,City,Sport,Discipline,Athlete,Country_x,Gender,Event,Medal,Country_y,Code,Population,GDP per Capita
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Hungary,HUN,9844686.0,12363.543460
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Austria,AUT,8611088.0,43774.985174
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Greece,GRE,10823732.0,18002.230578
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold,Greece,GRE,10823732.0,18002.230578
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver,Greece,GRE,10823732.0,18002.230578
...,...,...,...,...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze,Poland,POL,37999494.0,12554.547554
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold,Iran,IRI,79109272.0,NaN
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver,Russia,RUS,144096812.0,9092.580536
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze,Armenia,ARM,3017712.0,3489.127690
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze,Sweden,SWE,9798871.0,50579.673649

In [192]:
summer_new.loc[summer_new.Code.isnull(), 'Country_x'].value_counts()

URS    2049
GDR     825
ROU     640
FRG     490
YUG     435
TCH     329
EUA     260
EUN     223
ZZX      48
SRB      31
ANZ      29
RU1      17
MNE      14
TTO      10
BOH       7
BWI       5
SGP       4
IOP       3
Name: Country_x, dtype: int64

### Arithmetic operations between DataFrames / Alignment

__Import__ the csv-files __ath_2008.csv__ and __ath_2012.csv__ with all medals winners in the Sport __Athletics__ in the Editions __2008__ and __2012__.

In [229]:
ath_2008 = pd.read_csv('../data/part2/ath_2008.csv', index_col='Athlete')
ath_2012 = pd.read_csv('../data/part2/ath_2012.csv', index_col='Athlete')

For __all Athletes__ in the two DataFrames, __aggregate/add__ the total number of __Gold__, __Silver__ and __Bronze__ Medals over both editions! __Save__ the aggregated DataFrame in the variable __add__. (Hint: add should contain an index with the Athlete names and three columns, Gold, Silver, Bronze)

In [230]:
ath_2008, ath_2012

(                    Gold  Silver  Bronze
 Athlete
 ABAKUMOVA, Maria       0       1       0
 ABEYLEGESSE, Elvan     0       2       0
 ALEKNA, Virgilijus     0       0       1
 ALEXEEV, Denis         0       0       1
 ANTONOVA, Olena        0       0       1
 ...                  ...     ...     ...
 WINEBERG, Mary         1       0       0
 YEGO, Alfred Kirwa     0       0       1
 YURCHENKO, Denys       0       0       1
 ZHANG, Wenxiu          0       0       1
 ZHOU, Chunxiu          0       0       1

 [159 rows x 3 columns],
                          Gold  Silver  Bronze
 Athlete
 ADAMS, Valerie              1       0       0
 ALLEYNE-FORTE, Ade          0       0       1
 AMOS, Nijel                 0       1       0
 ANTYUKH, Natalya            1       1       0
 ASSEFA, Sofia               0       1       0
 ...                       ...     ...     ...
 WILLIAMS, Lauryn            1       0       0
 WILLIAMS, Shericka          0       0       1
 WILLIAMS-MILLS, Novlene     0       0       1
 WLODARCZYK, Anita           1       0       0
 ZHANG, Wenxiu               0       0       1

 [171 rows x 3 columns])

In [233]:
add = ath_2008.add(ath_2012, fill_value=0)

In [236]:
ath_2008.Gold.sum() + ath_2012.Gold.sum() == add.Gold.sum()

True

__Sort__ add by Gold, Silver, Bronze from __high to low__! Change datatype to __integer__, if necessary! The first Athlete in your DataFrame should be ... no surprise ... Usain Bolt with 6 Gold and 0 Silver and Bronze Medals.

In [238]:
add.sort_values(['Gold', 'Silver', 'Bronze'], ascending=False)

                         Gold  Silver  Bronze
Athlete
BOLT, Usain               6.0     0.0     0.0
FELIX, Allyson            4.0     1.0     0.0
DIBABA, Tirunesh          3.0     0.0     1.0
TAYLOR, Angelo            2.0     1.0     0.0
BEKELE, Kenenisa          2.0     0.0     0.0
...                       ...     ...     ...
WILLIAMS, Novelene        0.0     0.0     1.0
WILLIAMS-MILLS, Novlene   0.0     0.0     1.0
YEGO, Alfred Kirwa        0.0     0.0     1.0
YURCHENKO, Denys          0.0     0.0     1.0
ZHOU, Chunxiu             0.0     0.0     1.0

[298 rows x 3 columns]